In [2]:
import numpy as np
import pandas as pd

#1
Load the attendance.csv file and calculate an attendnace percentage for each student. One half day is worth 50% of a full day, and 10 tardies is equal to one absence.

In [3]:
att = pd.read_csv('attendance.csv')
att.head()

,Unnamed: 0,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [4]:
att.shape

(4, 9)

In [5]:
att.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 9 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  4 non-null      object
 1   2018-01-01  4 non-null      object
 2   2018-01-02  4 non-null      object
 3   2018-01-03  4 non-null      object
 4   2018-01-04  4 non-null      object
 5   2018-01-05  4 non-null      object
 6   2018-01-06  4 non-null      object
 7   2018-01-07  4 non-null      object
 8   2018-01-08  4 non-null      object
dtypes: object(9)
memory usage: 416.0+ bytes

In [7]:
# rename the column for names
att.rename(columns = {'Unnamed: 0' : 'name'}, inplace = True)
att.head()

,name,2018-01-01,2018-01-02,2018-01-03,2018-01-04,2018-01-05,2018-01-06,2018-01-07,2018-01-08
0,Sally,P,T,T,H,P,A,T,T
1,Jane,A,P,T,T,T,T,A,T
2,Billy,A,T,A,A,H,T,P,T
3,John,P,T,H,P,P,T,P,P

In [8]:
att_melt = att.melt(id_vars='name', var_name='date', value_name='attendance')
att_melt.head()

    name        date attendance
0  Sally  2018-01-01          P
1   Jane  2018-01-01          A
2  Billy  2018-01-01          A
3   John  2018-01-01          P
4  Sally  2018-01-02          T

In [10]:
#1
# calculate an attendance percentage for each student
att_melt.attendance.value_counts()

T    14
P     9
A     6
H     3
Name: attendance, dtype: int64

In [11]:
att_melt.name.value_counts()

Sally    8
John     8
Jane     8
Billy    8
Name: name, dtype: int64

In [12]:
#1
# change attendance to numeric data

def convert_att(x):
    if x == 'P':
        return 1
    elif x == 'H':
        return 0.5
    elif x == 'T':
        return 0.9
    else:
        return 0

att_melt['att_value'] = att_melt['attendance'].apply(convert_att)
att_melt.head()

    name        date attendance  att_value
0  Sally  2018-01-01          P        1.0
1   Jane  2018-01-01          A        0.0
2  Billy  2018-01-01          A        0.0
3   John  2018-01-01          P        1.0
4  Sally  2018-01-02          T        0.9

In [15]:
#1
# calculate each students attendance
# sum of days attendance / total days
att_sum = att_melt.groupby('name').att_value.sum()
att_sum

name
Billy    4.2
Jane     5.5
John     7.3
Sally    6.1
Name: att_value, dtype: float64

In [17]:
#1
total_days = att_melt.date.unique().size
total_days

8

In [18]:
#1
att_sum / total_days

name
Billy    0.5250
Jane     0.6875
John     0.9125
Sally    0.7625
Name: att_value, dtype: float64

#2
Coffee Levels

Read the coffee_levels.csv file.
Transform the data so that each carafe is in it's own column.
Is this the best shape for the data?

In [26]:
#2
coffee = pd.read_csv('coffee_levels.csv')
coffee.head()

   hour coffee_carafe  coffee_amount
0     8             x       0.816164
1     9             x       0.451018
2    10             x       0.843279
3    11             x       0.335533
4    12             x       0.898291

In [27]:
#2
coffee.shape

(30, 3)

In [28]:
#2
coffee.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30 entries, 0 to 29
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   hour           30 non-null     int64
 1   coffee_carafe  30 non-null     object
 2   coffee_amount  30 non-null     float64
dtypes: float64(1), int64(1), object(1)
memory usage: 848.0+ bytes

In [30]:
#2
coffee.coffee_carafe.value_counts()

x    10
z    10
y    10
Name: coffee_carafe, dtype: int64

In [32]:
#2
c_long= coffee.pivot(index='hour', columns='coffee_carafe', values='coffee_amount')
c_long

coffee_carafe         x         y         z
hour
8              0.816164  0.189297  0.999264
9              0.451018  0.521502  0.915990
10             0.843279  0.023163  0.144928
11             0.335533  0.235529  0.311495
12             0.898291  0.017009  0.771947
13             0.310711  0.997464  0.398520
14             0.507288  0.058361  0.864464
15             0.215043  0.144644  0.436364
16             0.183891  0.544676  0.280621
17             0.391560  0.594126  0.436677

In [33]:
#2
coffee.shape, c_long.shape
# The c_long shape is better because it separates the variables but still has the
# same number of cells
# This makes it more efficient

((30, 3), (10, 3))

#3
Cake Recipes

Read the cake_recipes.csv data. This data set contains cake tastiness scores for combinations of different recipes, oven rack positions, and oven temperatures.

Tidy the data as necessary.

Which recipe, on average, is the best? recipe b

Which oven temperature, on average, produces the best results? 275

Which combination of recipe, rack position, and temperature gives the best result? recipe b, bottom rack, 300 degrees

In [34]:
cake = pd.read_csv('cake_recipes.csv')
cake.head()

  recipe:position        225        250        275        300
0        a:bottom  61.738655  53.912627  74.414730  98.786784
1           a:top  51.709751  52.009735  68.576858  50.228470
2        b:bottom  57.095320  61.904369  61.196980  99.248541
3           b:top  82.455004  95.224151  98.594881  58.169349
4        c:bottom  96.470207  52.001358  92.893227  65.473084

In [35]:
cake.shape

(8, 5)

In [36]:
cake.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   recipe:position  8 non-null      object
 1   225              8 non-null      float64
 2   250              8 non-null      float64
 3   275              8 non-null      float64
 4   300              8 non-null      float64
dtypes: float64(4), object(1)
memory usage: 448.0+ bytes

In [41]:
r_p = cake['recipe:position'].str.split('[:]', expand=True)
r_p.rename(columns={0:'recipe', 1:'position'}, inplace=True)
r_p

  recipe position
0      a   bottom
1      a      top
2      b   bottom
3      b      top
4      c   bottom
5      c      top
6      d   bottom
7      d      top

In [43]:
cake2 = pd.concat([cake, r_p], axis=1).drop(columns='recipe:position')
cake2

         225        250        275        300 recipe position
0  61.738655  53.912627  74.414730  98.786784      a   bottom
1  51.709751  52.009735  68.576858  50.228470      a      top
2  57.095320  61.904369  61.196980  99.248541      b   bottom
3  82.455004  95.224151  98.594881  58.169349      b      top
4  96.470207  52.001358  92.893227  65.473084      c   bottom
5  71.306308  82.795477  92.098049  53.960273      c      top
6  52.799753  58.670419  51.747686  56.183110      d   bottom
7  96.873178  76.101363  59.571620  50.971626      d      top

In [45]:
cake3 = cake2.melt(id_vars=['recipe', 'position'], 
                  var_name='oven_temp',
                  value_name='tastiness_score')
cake3

   recipe position oven_temp  tastiness_score
0       a   bottom       225        61.738655
1       a      top       225        51.709751
2       b   bottom       225        57.095320
3       b      top       225        82.455004
4       c   bottom       225        96.470207
5       c      top       225        71.306308
6       d   bottom       225        52.799753
7       d      top       225        96.873178
8       a   bottom       250        53.912627
9       a      top       250        52.009735
10      b   bottom       250        61.904369
11      b      top       250        95.224151
12      c   bottom       250        52.001358
13      c      top       250        82.795477
14      d   bottom       250        58.670419
15      d      top       250        76.101363
16      a   bottom       275        74.414730
17      a      top       275        68.576858
18      b   bottom       275        61.196980
19      b      top       275        98.594881
20      c   bottom       275        92.893227
21      c      top       275        92.098049
22      d   bottom       275        51.747686
23      d      top       275        59.571620
24      a   bottom       300        98.786784
25      a      top       300        50.228470
26      b   bottom       300        99.248541
27      b      top       300        58.169349
28      c   bottom       300        65.473084
29      c      top       300        53.960273
30      d   bottom       300        56.183110
31      d      top       300        50.971626

In [48]:
#3
cake3.groupby('recipe').tastiness_score.mean().sort_values(ascending=False)
# recipe 'b' produces the best results on average

recipe
b    76.736074
c    75.874748
a    63.922201
d    62.864844
Name: tastiness_score, dtype: float64

In [49]:
#3
cake3.groupby('oven_temp').tastiness_score.mean().sort_values(ascending=False)
# 275 temp produces the best results on average

oven_temp
275    74.886754
225    71.306022
300    66.627655
250    66.577437
Name: tastiness_score, dtype: float64

In [52]:
#3
cake3.groupby(['recipe', 'oven_temp', 'position']).tastiness_score.mean().nlargest(1)
# the combination that gives the best results on average is b/300/bottom

recipe  oven_temp  position
b       300        bottom      99.248541
Name: tastiness_score, dtype: float64